In [1]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

In [2]:
%%sql 
SELECT * FROM sqlite_master WHERE type = 'table'

Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [4]:
%%sql
SELECT COUNT(*) FROM sqlite_master;

Done.

[(2,)]

In [6]:
%%sql
SELECT *
    FROM facts
    LIMIT 5;

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

## Table information of the database

In [8]:
%%sql
SELECT *
    FROM sqlite_master

Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [10]:
%%sql
PRAGMA TABLE_INFO(facts)

Done.

[(0, 'id', 'INTEGER', 1, None, 1),
 (1, 'code', 'varchar(255)', 1, None, 0),
 (2, 'name', 'varchar(255)', 1, None, 0),
 (3, 'area', 'integer', 0, None, 0),
 (4, 'area_land', 'integer', 0, None, 0),
 (5, 'area_water', 'integer', 0, None, 0),
 (6, 'population', 'integer', 0, None, 0),
 (7, 'population_growth', 'float', 0, None, 0),
 (8, 'birth_rate', 'float', 0, None, 0),
 (9, 'death_rate', 'float', 0, None, 0),
 (10, 'migration_rate', 'float', 0, None, 0)]

In [12]:
%%sql
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
    FROM facts;

Done.

[(0, 7256490011, 0.0, 4.02)]

In [16]:
%%sql
SELECT name, population
    FROM facts
    ORDER BY population DESC
    LIMIT 5;

Done.

[('World', 7256490011),
 ('China', 1367485388),
 ('India', 1251695584),
 ('European Union', 513949445),
 ('United States', 321368864)]

In [17]:
%%sql 
SELECT name, MAX(population)
    FROM facts;

Done.

[('World', 7256490011)]

In [18]:
%%sql 
SELECT name, MIN(population)
    FROM facts;

Done.

[('Antarctica', 0)]

## Find the most and least population countries

In [19]:
%%sql
SELECT name, population
    FROM facts
    WHERE population = (SELECT MAX(population) FROM facts)
        OR population = (SELECT MIN(population) FROM facts)

Done.

[('Antarctica', 0), ('World', 7256490011)]

In [20]:
%%sql 
SELECT AVG(population), AVG(area)
    FROM facts;

Done.

[(62094928.32231405, 555093.546184739)]

## Which country has more than average population but less than average area?

In [21]:
%%sql
SELECT name, population, area
    FROM facts
    WHERE population > (SELECT AVG(population) FROM facts)
        AND area < (SELECT AVG(area) FROM facts);

Done.

[('Bangladesh', 168957745, 148460),
 ('Germany', 80854408, 357022),
 ('Japan', 126919659, 377915),
 ('Philippines', 100998376, 300000),
 ('Thailand', 67976405, 513120),
 ('United Kingdom', 64088222, 243610),
 ('Vietnam', 94348835, 331210)]

## Whick countries have the highest ratios of water to land? Which countries have more water than land?

In [23]:
%%sql
SELECT name, MAX(CAST(area_water AS Float) / area_land)
    FROM facts;

Done.

[('British Indian Ocean Territory', 905.6666666666666)]

In [24]:
%%sql
SELECT name, area_water, area_land
    FROM facts
    WHERE area_water > area_land;

Done.

[('British Indian Ocean Territory', 54340, 60), ('Virgin Islands', 1564, 346)]

## Which countries will add the most people to their populatin next year?

In [28]:
%%sql
SELECT name, (population * population_growth) AS population_will_increase
    FROM facts
    ORDER BY population_will_increase DESC
    LIMIT 5;

Done.

[('World', 7837009211.88),
 ('India', 1527068612.48),
 ('China', 615368424.6),
 ('Nigeria', 444827037.20000005),
 ('Pakistan', 290665336.62)]

## Which countries have a higher death rate than birth rate?

In [34]:
%%sql 
SELECT name, death_rate, birth_rate, (death_rate - birth_rate) AS death_birth_difference
    FROM facts
    WHERE death_rate > birth_rate
    ORDER BY death_birth_difference DESC
    LIMIT 5;

Done.

[('Bulgaria', 14.44, 8.92, 5.52),
 ('Serbia', 13.66, 9.08, 4.58),
 ('Latvia', 14.31, 10.0, 4.3100000000000005),
 ('Lithuania', 14.27, 10.1, 4.17),
 ('Ukraine', 14.46, 10.72, 3.74)]